{
  "basics": {
    "name": "Mohammed EL KOUCH",
    "alias": "medelkouch",
    "label": "FullStack Developer",
    "image": "/me.webp",
    "email": "mohammed.elkouch1998@gmail.com",
    "phone": "+212 701292507",
    "url": "https://medelkouch.com",
    "contact_tooltips": {
      "mail": "Send mail to Mohammed",
      "phone": "Call Me",
      "GitHub": "Go to Mohammed's GitHub Profile",
      "LinkedIn": "Go to Mohammed's LinkedIn Profile",
      "download": "Download Resume"
    },
    "about": {
      "title": "About Me",
      "summary": "Experienced full-stack developer with over three years of professional experience in designing and implementing scalable web applications using Angular, NestJS, and TypeScript. Skilled at delivering high-impact solutions that drive performance improvements, enhance user satisfaction, and streamline operations. Proficient in both front-end and back-end development, with a strong focus on mentoring and team collaboration."
    },
    "location": {
      "postalCode": "111160",
      "city": "Sale",
      "countryCode": "MA",
      "region": "Morocco"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "Medelkouch98",
        "url": "https://github.com/medelkouch98"
      },
      {
        "network": "LinkedIn",
        "username": "mohammed el kouch",
        "url": "https://www.linkedin.com/in/mohammed-el-kouch/"
      }
    ]
  },

  "experience": {
    "title": "Experience",
    "jobs": [
      {
        "position": "Front End Developer",
        "company": "Elham",
        "startDate": "02/2024",
        "endDate": "",
        "stillWorking": "Present",

        "summary": {
          "main": "Elham is a learning experience platform (LXP) designed to boost and support continuous learning in organizations by creating, managing, and tracking training programs easily. Here's a glimpse of my contributions and responsibilities throughout the project:",
          "extra": {
            "bullet_points": [
              "Executed a comprehensive migration from Angular15 to Angular 19, utilizing Angular's migration tools to ensure a seamless transition.",
              "Collaborated with backend developers to integrate RESTful APIs, ensuring efficient data retrieval and manipulation.",
              "Implemented lazy loading and modularization to optimize application performance and load times.",
              "Refactored legacy code to align with modern Angular architecture, improving code readability and maintainability.",
              "Conducted unit and integration testing to verify the functionality and reliability of migrated components."
            ]
          }
        }
      },
      {
        "position": "Full Stack Developer",
        "company": "Elham",
        "startDate": "02/2024",
        "endDate": "08/2024",
        "stillWorking": "",

        "summary": {
          "main": "Maher is an intelligent assistant designed to streamline training and development operations within organizations. It automates processes systematically and employs smart technology at every step to make tasks more organized, better processed, more accurately evaluated, and faster in feedback. Here's a glimpse of my contributions and responsibilities throughout the project:",
          "extra": {
            "bullet_points": [
              "Developed the backend architecture using NestJS, implementing RESTful APIs for seamless data exchange.",
              "Designed and managed the PostgreSQL database schema, ensuring data integrity and efficient querying.",
              "Utilized PrismaORM for database interactions, streamlining data modeling and migrations.",
              "Created dynamic and responsive user interfaces with Angular 18, enhancing user engagement.",
              "Integrated Keycloak to implement authentication and authorization mechanisms, securing the platform.",
              "Conducted comprehensive testing and debugging to maintain high-quality code standards.",
              "Generated comprehensive API documentation using OpenAPI (Swagger) with NestJS, facilitating clear communication and ease of use for developers."
            ]
          }
        }
      },
      {
        "position": "Full Stack Developer",
        "company": "Aba Technology",
        "stillWorking": "",
        "startDate": "01/2022",
        "endDate": "01/2024",
        "summary": {
          "main": "E-services is a digital platform that streamlines the evaluation of registration files and quality control for various health products, including medicines. This initiative enhances transparency, efficiency, and accessibility for stakeholders in the pharmaceutical sector. Here's a glimpse of my contributions and responsibilities throughout the project:",
          "extra": {
            "bullet_points": [
              "Collaborated with cross-functional teams to understand the project's scope and objectives.",
              "Assessed existing software programs, identifying areas for improvement and optimization.",
              "Conducted thorough market research and competitor analysis to stay updated with industry trends and best practices.",
              "Wrote clean, efficient, and scalable code to create the core components of the E-services platform.",
              "Debugged and resolved issues promptly to maintain seamless functionality.",
              "Actively recommended and executed application improvements based on user feedback and emerging technologies.",
              "Worked closely with the team to implement updates and enhancements, enhancing the platform's user experience.",
              "Provided timely support to resolve any technical issues or challenges encountered by users.",
              "Implemented microservices architecture principles to ensure efficient communication and flexibility within the system."
            ]
          }
        }
      },

      {
        "position": "Full Stack Developer",
        "company": "Novaxys",
        "startDate": "06/2021",
        "endDate": "12/2021",
        "stillWorking": "",
        "summary": {
          "main": "Novaxys is a consulting and IT solutions company, specializing in digital transformation. One of their notable projects is the development of a loyalty application similar to Kenz'up, designed to enhance customer engagement and retention for financial institutions. Here's a glimpse of my contributions and responsibilities throughout the project:",
          "extra": {
            "bullet_points": [
              "Seamless integration with partner stores, allowing users to earn and redeem loyalty points effortlessly.",
              "Secure payment options enabling users to pay using their credit cards directly through the app, utilizing tools such as Stripe and PayPal for secure transactions.",
              "Real-time tracking of earned and redeemed points, providing transparency and encouraging user engagement."
            ]
          }
        }
      }
    ]
  },

  "education": {
    "title": "Education",
    "list": [
      {
        "institution": "National School of Applied Sciences Ibn Tofail",
        "url": "https://ensa.uit.ac.ma/",
        "area": "Master’s Degree in Systems and Products Management, Engineering/Industrial Management",
        "startDate": "09/2019",
        "endDate": "08/2021"
      }
    ]
  },

  "certificates": {
    "list": [
      {
        "name": "Advanced TypeScript - A Production-grade TypeScript Course",
        "date": "12/2024",
        "issuer": "Udemy",
        "url": "https://udemy-certificate.s3.amazonaws.com/image/UC-00a06b88-7037-46c3-a3a5-3ecef2fa8fe8.jpg"
      },
      {
        "name": "Microsoft Certified : Data Analyst Associate",
        "date": "11/2022",
        "issuer": "Microsoft",
        "url": "https://www.credly.com/badges/f0af9142-769f-4272-9591-881798748096"
      }
    ]
  },

  "skills": {
    "title": "Skills",
    "list": [
      {
        "name": "HTML",
        "level": "Master"
      },
      {
        "name": "CSS",
        "level": "Master"
      },
      {
        "name": "JavaScript",
        "level": "Master"
      },
      {
        "name": "NodeJS",
        "level": "Master"
      },
      {
        "name": "TypeScript",
        "level": "Advanced"
      },
      {
        "name": "Angular",
        "level": "Advanced"
      },
      {
        "name": "NestJs",
        "level": "Advanced"
      },
      {
        "name": "Tailwind",
        "level": "Medium"
      },
      {
        "name": "Python",
        "level": "Medium"
      },
      {
        "name": "FastApi",
        "level": "Medium"
      },
      {
        "name": "Unit test",
        "level": "Medium"
      },
      {
        "name": "React",
        "level": "Basics"
      },
      {
        "name": "Firebase",
        "level": "Medium"
      },
      {
        "name": "OpenAI API",
        "level": "Medium"
      },
      {
        "name": "AWS",
        "level": "Medium"
      },
      {
        "name": "Git",
        "level": "Advanced"
      }
    ]
  },
  "languages": {
    "title": "Languages",
    "list": [
      {
        "language": "Arabic",
        "fluency": "Native speaker"
      },
      {
        "language": "English",
        "fluency": "Professional working proficiency"
      },
      {
        "language": "French",
        "fluency": "Professional working proficiency"
      }
    ]
  },
  "projects": {
    "title": "Projects",
    "description": "For more information, visit:",
    "list": [
      {
        "name": "DMP– E-services Platform",
        "isActive": true,
        "description": "Built a comprehensive platform for the Directorate of Medicines and Pharmacy to streamline administrative operations and enhance accessibility for healthcare providers",
        "highlights": [
          "NestJS",
          "Angular",
          "Tailwind",
          "TS",
          "MongoDB",
          "Nx"
        ],
        "url": "https://dmp.sante.gov.ma/e-services"
      },
      {
        "name": "Elham– LXP Platform",
        "isActive": true,
        "description": "Developed a platform for organizations to create, manage, and monitor training programs.",
        "highlights": ["Angular", "Tailwind", "TypeScript"],
        "url": "https://www.elham.sa/en/home"
      },
      {
        "name": "Maher– Training Assistant",
        "isActive": true,
        "description": "Created a tool to optimize training and development processes, automating scheduling and reporting functionalities.",
        "highlights": [
          "NestJS",
          "Angular",
          "Tailwind",
          "Ts",
          "Postgres",
          "Nx",
          "PrismaORM"
        ],
        "url": "https://joinmaher.com/"
      }
    ]
  }
}
