{
  "basics": {
    "name": "Mohammed EL KOUCH",
    "alias": "medelkouch",
    "label": "Développeur FullStack",
    "image": "/me.webp",
    "email": "mohammed.elkouch1998@gmail.com",
    "phone": "+212 701292507",
    "url": "https://medelkouch.com",
    "contact_tooltips": {
      "mail": "Envoyer un e-mail à Mohammed",
      "phone": "Appeler Mohammed",
      "GitHub": "Accéder au profil GitHub de Mohammed",
      "LinkedIn": "Accéder au profil LinkedIn de Mohammed",
      "download": "Télécharger le CV"
    },
    "about": {
      "title": "À Propos de Moi",
      "summary": "Développeur full-stack expérimenté avec plus de trois ans d'expérience professionnelle dans la conception et la mise en œuvre d'applications web évolutives en utilisant Angular, NestJS et TypeScript. Compétent pour fournir des solutions à fort impact qui améliorent les performances, la satisfaction des utilisateurs et optimisent les opérations. Expert en développement front-end et back-end, avec un fort accent sur le mentorat et la collaboration en équipe."
    },
    "location": {
      "postalCode": "111160",
      "city": "Salé",
      "countryCode": "MA",
      "region": "Maroc"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "Medelkouch98",
        "url": "https://github.com/medelkouch98"
      },
      {
        "network": "LinkedIn",
        "username": "Mohammed EL KOUCH",
        "url": "https://www.linkedin.com/in/mohammed-el-kouch/"
      }
    ]
  },

"experience": {
  "title": "Expérience",
  "jobs": [
    {
      "position": "Développeur Front-End",
      "company": "Elham",
      "startDate": "02/2024",
      "endDate": "",
      "stillWorking": "Actuellement",

      "summary": {
        "main": "Elham est une plateforme d'expérience d'apprentissage (LXP) conçue pour stimuler et soutenir l'apprentissage continu dans les organisations en créant, gérant et suivant facilement des programmes de formation. Voici un aperçu de mes contributions et responsabilités tout au long du projet :",
        "extra": {
          "bullet_points": [
            "Réalisé une migration complète d'Angular15 à Angular19, en utilisant les outils de migration d'Angular pour assurer une transition fluide.",
            "Collaboré avec les développeurs backend pour intégrer des API RESTful, garantissant une récupération et une manipulation efficaces des données.",
            "Implémenté le chargement différé et la modularisation pour optimiser les performances et les temps de chargement de l'application.",
            "Refactorisé le code existant pour l'aligner avec l'architecture moderne d'Angular, améliorant la lisibilité et la maintenabilité du code.",
            "Effectué des tests unitaires et d'intégration pour vérifier la fonctionnalité et la fiabilité des composants migrés."
          ]
        }
      }
    },
    {
      "position": "Développeur Full-Stack",
      "company": "Elham",
      "startDate": "02/2024",
      "endDate": "08/2024",
      "stillWorking": "",

      "summary": {
        "main": "Maher est un assistant intelligent conçu pour rationaliser les opérations de formation et de développement au sein des organisations. Il automatise les processus de manière systématique et utilise une technologie intelligente à chaque étape pour rendre les tâches mieux organisées, mieux traitées, plus précisément évaluées et plus rapides en termes de retour d'information. Voici un aperçu de mes contributions et responsabilités tout au long du projet :",
        "extra": {
          "bullet_points": [
            "Développé l'architecture backend en utilisant NestJS, en implémentant des API RESTful pour un échange de données fluide.",
            "Conçu et géré le schéma de base de données PostgreSQL, garantissant l'intégrité des données et une interrogation efficace.",
            "Utilisé PrismaORM pour les interactions avec la base de données, simplifiant la modélisation et les migrations de données.",
            "Créé des interfaces utilisateur dynamiques et réactives avec Angular18, améliorant l'engagement des utilisateurs.",
            "Intégré Keycloak pour mettre en œuvre des mécanismes d'authentification et d'autorisation, sécurisant la plateforme.",
            "Effectué des tests et du débogage complets pour maintenir des normes de qualité de code élevées.",
            "Généré une documentation API complète en utilisant OpenAPI (Swagger) avec NestJS, facilitant une communication claire et une utilisation facile pour les développeurs."
          ]
        }
      }
    },
    {
      "position": "Développeur Full-Stack",
      "company": "Aba Technology",
      "stillWorking": "",
      "startDate": "01/2022",
      "endDate": "01/2024",
      "summary": {
        "main": "E-services est une plateforme numérique qui simplifie l'évaluation des dossiers d'inscription et le contrôle qualité pour divers produits de santé, y compris les médicaments. Cette initiative améliore la transparence, l'efficacité et l'accessibilité pour les parties prenantes du secteur pharmaceutique. Voici un aperçu de mes contributions et responsabilités tout au long du projet :",
        "extra": {
          "bullet_points": [
            "Collaboré avec des équipes interfonctionnelles pour comprendre la portée et les objectifs du projet.",
            "Évalué les programmes logiciels existants, identifiant les domaines à améliorer et à optimiser.",
            "Effectué des recherches de marché approfondies et des analyses de la concurrence pour rester à jour avec les tendances de l'industrie et les meilleures pratiques.",
            "Écrit un code propre, efficace et évolutif pour créer les composants principaux de la plateforme E-services.",
            "Débogué et résolu rapidement les problèmes pour maintenir une fonctionnalité sans faille.",
            "Recommandé et mis en œuvre activement des améliorations de l'application basées sur les retours des utilisateurs et les technologies émergentes.",
            "Travaillé en étroite collaboration avec l'équipe pour mettre en œuvre des mises à jour et des améliorations, améliorant l'expérience utilisateur de la plateforme.",
            "Fournit un support rapide pour résoudre tout problème technique ou défi rencontré par les utilisateurs.",
            "Implémenté les principes d'architecture microservices pour garantir une communication efficace et une flexibilité au sein du système."
          ]
        }
      }
    },

    {
      "position": "Développeur Full-Stack",
      "company": "Novaxys",
      "startDate": "06/2021",
      "endDate": "12/2021",
      "stillWorking": "",
      "summary": {
        "main": "Novaxys est une société de conseil et de solutions informatiques, spécialisée dans la transformation numérique. L'un de leurs projets notables est le développement d'une application de fidélité similaire à Kenz'up, conçue pour renforcer l'engagement et la fidélisation des clients pour les institutions financières. Voici un aperçu de mes contributions et responsabilités tout au long du projet :",
        "extra": {
          "bullet_points": [
            "Intégration fluide avec des magasins partenaires, permettant aux utilisateurs de gagner et d'utiliser des points de fidélité facilement.",
            "Options de paiement sécurisées permettant aux utilisateurs de payer avec leurs cartes de crédit directement via l'application, en utilisant des outils comme Stripe et PayPal pour des transactions sécurisées.",
            "Suivi en temps réel des points gagnés et utilisés, offrant transparence et encouragement à l'engagement des utilisateurs."
          ]
        }
      }
    }
  ]
},

  "education": {
    "title": "Éducation",
    "list": [
      {
        "institution": "École Nationale des Sciences Appliquées Ibn Tofail",
        "url": "https://ensa.uit.ac.ma/",
        "area": "Master en Gestion des Systèmes et Produits, Ingénierie/Gestion Industrielle",
        "startDate": "09/2019",
        "endDate": "08/2021"
      }
    ]
  },

  "certificates": {
    "list": [
      {
        "name": "TypeScript Avancé - Un Cours de TypeScript de Niveau Production",
        "date": "12/2024",
        "issuer": "Udemy",
        "url": "https://udemy-certificate.s3.amazonaws.com/image/UC-00a06b88-7037-46c3-a3a5-3ecef2fa8fe8.jpg"
      },
      {
        "name": "Microsoft Certified : Data Analyst Associate",
        "date": "11/2022",
        "issuer": "Microsoft",
        "url": "https://www.credly.com/badges/f0af9142-769f-4272-9591-881798748096"
      }
    ]
  },

  "skills": {
    "title": "Compétences",
    "list": [
      { "name": "HTML", "level": "Maître" },
      { "name": "CSS", "level": "Maître" },
      { "name": "JavaScript", "level": "Maître" },
      { "name": "NodeJS", "level": "Maître" },
      { "name": "TypeScript", "level": "Avancé" },
      { "name": "Angular", "level": "Avancé" },
      { "name": "NestJs", "level": "Avancé" },
      { "name": "Tailwind", "level": "Intermédiaire" },
      { "name": "Python", "level": "Intermédiaire" },
      { "name": "FastApi", "level": "Intermédiaire" },
      { "name": "Unit test", "level": "Intermédiaire" },
      { "name": "React", "level": "Débutant" },
      { "name": "Firebase", "level": "Intermédiaire" },
      { "name": "OpenAI API", "level": "Intermédiaire" },
      { "name": "AWS", "level": "Intermédiaire" },
      { "name": "Git", "level": "Avancé" }
    ]
  },
  "languages": {
    "title": "Langues",
    "list": [
      { "language": "Arabe", "fluency": "Langue maternelle" },
      { "language": "Anglais", "fluency": "Compétence professionnelle" },
      { "language": "Français", "fluency": "Compétence professionnelle" }
    ]
  },
  "projects": {
    "title": "Projets",
    "description": "Pour plus d'informations, visitez :",
    "list": [
      {
        "name": "DMP– Plateforme de E-Services",
        "isActive": true,
        "description": "Développement d'une plateforme complète pour la Direction des Médicaments et de la Pharmacie pour rationaliser les opérations administratives et améliorer l'accessibilité pour les prestataires de soins de santé.",
        "highlights": [
            "NestJS",
            "Angular",
            "Tailwind",
            "TS",
            "MongoDB",
            "Nx"
          ],
        "url": "https://dmp.sante.gov.ma/e-services"
      },
      {
        "name": "Elham– LXP Platforme",
        "isActive": true,
        "description": "Développement d'une plateforme pour les organisations afin de créer, gérer et suivre les programmes de formation.",
        "highlights": ["Angular", "Tailwind", "TypeScript"],
        "url": "https://www.elham.sa/en/home"
      },
      {
        "name": "Maher– Assistant de Formation",
        "isActive": true,
        "description": "Création d'un outil pour optimiser les processus de formation et de développement, en automatisant la planification et les fonctionnalités de reporting.",
        "highlights": [
            "NestJS",
            "Angular",
            "Tailwind",
            "Ts",
            "Postgres",
            "Nx",
            "PrismaORM"
          ],
        "url": "https://joinmaher.com/"
      }
    ]
  }
}
